Let’s assume we have a table named “**employees**” with the following columns:

- **id:** the unique identifier for each employee
- **name**: the name of the employee
- **gender:** the gender of the employee
- **salary:** the salary of the employee
- **department:** the department of the employee

   id           name  gender  salary department
0   1   Ramesh Gupta    Male   55000      Sales
1   2   Priya Sharma  Female   65000  Marketing
2   3   Sanjay Singh    Male   75000      Sales
3   4   Anjali Verma  Female   45000    Finance
4   5  Rajesh Sharma    Male   80000  Marketing
5   6    Smita Patel  Female   60000         HR
6   7   Vikram Yadav    Male   90000      Sales
7   8    Neha Sharma  Female   55000  Marketing
8   9    Rahul Singh    Male   70000    Finance
9  10   Sonali Gupta  Female   50000      Sales

## Queries

### Write a query to find the average salary of male and female employees in each department.

  department  gender  avg_salary
0      Sales    Male  73333.3333
1  Marketing  Female  60000.0000
2    Finance  Female  45000.0000
3  Marketing    Male  80000.0000
4         HR  Female  60000.0000
5    Finance    Male  70000.0000
6      Sales  Female  50000.0000

### Write a query to find the name and salary of the employee with the highest salary in each department.

  department           name  salary
0  Marketing  Rajesh Sharma   80000
1         HR    Smita Patel   60000
2      Sales   Vikram Yadav   90000
3    Finance    Rahul Singh   70000

### Write a query to find the names of employees who earn more than the average salary in their department.

            name  salary department
0   Sanjay Singh   75000      Sales
1  Rajesh Sharma   80000  Marketing
2   Vikram Yadav   90000      Sales
3    Rahul Singh   70000    Finance

### Find the top 3 highest paid employees in each department.

  department           name  salary
0      Sales   Ramesh Gupta   55000
1  Marketing   Priya Sharma   65000
2      Sales   Sanjay Singh   75000
3    Finance   Anjali Verma   45000
4  Marketing  Rajesh Sharma   80000
5         HR    Smita Patel   60000
6      Sales   Vikram Yadav   90000
7  Marketing    Neha Sharma   55000
8    Finance    Rahul Singh   70000

### Find the names of employees who have a salary greater than the average salary of their department.

            name
0   Sanjay Singh
1  Rajesh Sharma
2   Vikram Yadav
3    Rahul Singh

### Find the department(s) with the highest paid employee(s).

  department           name  salary
0  Marketing  Rajesh Sharma   80000
1         HR    Smita Patel   60000
2      Sales   Vikram Yadav   90000
3    Finance    Rahul Singh   70000